OK, so have spent a bit more time experimenting today, and with a typed object variable, I simply can't get the existing code logic to work.

I assert that this is due to `try()`'s behavior of treating `null` values as "valid" as they don't throw an error:
> `try` evaluates all of its argument expressions in turn and returns the result of the first one that does not produce any errors.
- https://developer.hashicorp.com/terraform/language/functions/try

The above example Gist gives the following output for the `var.listeners` value:
```
  + listeners = {
      + http = {
          + fixed_response = {
              + content_type = "text/plain"
              + message_body = null
              + status_code  = "404"
            }
          + forward        = null
          + port           = 80
          + protocol       = "HTTP"
          + redirect       = {
              + host        = "#{host}"
              + path        = "#{path}"
              + port        = "#{port}"
              + protocol    = "#{protocol}"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
          + rules          = {}
        }
    }
```

As you can see, `forward` is `null`, so rationally I wouldn't expect this code to trigger:
https://github.com/terraform-aws-modules/terraform-aws-alb/blob/46ec74232f910a22c2756473d24ee96dc62e4d3e/main.tf#L152-L160

However it does trigger, and results in the following error:
```
│ Error: Invalid Attribute Combination
│
│ Either "default_action[1].target_group_arn" or "default_action[1].forward" must be specified when "default_action[1].type" is "forward".
│ default_action[1].type
│
│   with module.alb.aws_lb_listener.this["http"],
│   on .terraform/modules/alb/main.tf line 88, in resource "aws_lb_listener" "this":
│   88: resource "aws_lb_listener" "this" {
│
╵
```
Note that it's index `1` in the `default_action` dynamic block, as the `fixed_response` default_action is populated before - https://github.com/terraform-aws-modules/terraform-aws-alb/blob/46ec74232f910a22c2756473d24ee96dc62e4d3e/main.tf#L137-L150

I also tried setting up "default" values for the fields within the `forward` default_action block, but that still fails with the above error...

If I switch to the changes proposed in #389 , then the plan succeeds, and the following ALB resources would be created:
```
  # module.alb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = true
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = (known after apply)
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "alb-null-error"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                                                     = {
          + "terraform-aws-modules" = "alb"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + timeouts {}
    }

  # module.alb.aws_lb_listener.this["http"] will be created
  + resource "aws_lb_listener" "this" {
      + arn                      = (known after apply)
      + id                       = (known after apply)
      + load_balancer_arn        = (known after apply)
      + port                     = 80
      + protocol                 = "HTTP"
      + ssl_policy               = (known after apply)
      + tags                     = {
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                 = {
          + "terraform-aws-modules" = "alb"
        }
      + tcp_idle_timeout_seconds = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + status_code  = "404"
            }
        }
    }
```

As you can see, the correct singular `default_action` is being applied.

Based on the above, I would ask you to reconsider your stance on the changes from #389 as I believe they are a safe and useful improvement to the current behaviour.